// Выведите на экран любое значение с помощью console.log
console.log(34);
// Создайте две переменные с числами. Выведите их на экран
var peremennaya1=10
var peremennaya2 = 20
console.log(peremennaya1,peremennaya2);
// Сложите две переменные и выведите результат на экран
alert (`результат: ${peremennaya1+peremennaya2}`);
// Поищите в интернете функции для преобразования строки в верхний и нижний регистр. Выведите на экран два этих значения. 
console.log('hi hello'.toUpperCase());
console.log('HI HELLO'.toLowerCase());
// Запишите в свой скрипт реализацию каждой базовой операции над числами. Также посмотрите в интернете как возводить число в квадрат, получать остаток от деления
alert (`вычитание: ${peremennaya1-peremennaya2}, сложение: ${peremennaya1+peremennaya2}, умножение: ${peremennaya1*peremennaya2}, деление: ${peremennaya2/peremennaya1}, остаток от деления: ${peremennaya1%peremennaya2}, возведение в степень: ${peremennaya1**peremennaya2}`);
// Придумайте два задания и покажите преподавателю
// Соединить две переменные, содержащие текст, в одно предложение.
var per1="Я люблю кушать "
var per2="вкусно и много"
alert( `результат: ${per1+per2}`);
// Вставить переменную, содержащую текстовое значение, в текст.
var perem1 = "Имя"
alert( `результат: ${perem1}?
– Мое? – Мое – мне известно. Не притворяйся более глупым, чем ты есть.("Мастер и Маргарита")` );
